In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split

# Dataset Iris

In [2]:
# Chargement des données
iris_df = pd.read_csv("iris.csv")
print(iris_df.head())

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [3]:
# Séparation des variables
# Créer un df Y avec seulement la colonne variety, car c'est ce qu'on veut prédire
y = iris_df['variety']
# Créer un df X avec toutes les colonnes sauf variety, pour pouvoir la prédire grâce à ces variables
X = iris_df.drop(labels='variety', axis=1)

#sépare les données en deux groupes :
#Entraînement (80%) : pour que le modèle apprenne.
#Test (20%) : pour évaluer s’il a bien appris.
#random_state=42 pour le hasard, sinon on aurait toujours le même découpage ("The Hitchhiker's Guide to the Galaxy" de Douglas Adams)
train_X_iris, test_X_iris, train_y_iris, test_y_iris = train_test_split(X, y, train_size=0.8, test_size=0.2, random_state=42)

# Dataset Titanic

In [4]:
titanic_df = pd.read_csv("titanic.csv")
titanic_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S